/**
 * Квадратичная сортировка выборкой.
 * Поиск минимального значения в массиве и обмен его с текущим элементом поиска.
 * По умолчанию 1 элемент минимальный.
 * Последний элемент автоматически отсортирован.
 * Сортируется левая часть.
 * ```
 * [ 4, 2, 5, 1, 3 ]
 * [ 2, 4, 5, 1, 3 ]
 * [ 1, 4, 5, 2, 3 ]
 * [ 1, 2, 5, 4, 3 ]
 * [ 1, 2, 4, 5, 3 ]
 * [ 1, 2, 3, 5, 4 ]
 * [ 1, 2, 3, 4, 5 ]
 * ```
 * @param A - исходный массив
 */
function choiseSort(A: (number | string)[]): (number | string)[] {
    for (let k = 0; k < A.length - 1; k++) {
        for (let m = k + 1; m < A.length; m++) {
            const min = A[k];

            if (A[m] < min) {
                A[k] = A[m]; A[m] = min;
            }
        }
    }

    return A;
}

export default choiseSort;
